sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_spi.c
/****************************************************************************
 * arch/risc-v/src/esp32p4/espressif/esp_spi.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/kmalloc.h>

#ifdef CONFIG_ESPRESSIF_SPI_PERIPH

#include <assert.h>
#include <debug.h>
#include <sys/param.h>
#include <sys/types.h>
#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <time.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/clock.h>
#include <nuttx/mutex.h>
#include <nuttx/spi/spi.h>
#include <nuttx/nuttx.h>

#include <arch/board/board.h>

#include "esp_spi.h"
#include "esp_irq.h"
#include "esp_gpio.h"

#include "riscv_internal.h"

#include "esp_cache.h"
#include "esp_heap_caps.h"
#include "esp_private/esp_cache_private.h"
#include "hal/spi_hal.h"
#include "hal/spi_types.h"
#include "esp_clk_tree.h"
#include "esp_clk_tree_common.h"
#include "hal/clk_tree_hal.h"
#include "hal/hal_utils.h"
#include "periph_ctrl.h"
#include "esp_private/spi_share_hw_ctrl.h"
#include "hal/gdma_periph.h"
#include "hal/gdma_ll.h"
#include "hal/dma_types.h"
#include "esp_memory_utils.h"

#if SOC_GDMA_SUPPORTED
#  include "esp_private/gdma.h"
#endif

#ifdef CONFIG_PM
#  include "include/esp_pm.h"
#endif

#ifdef CONFIG_ESPRESSIF_LPSPI0
#  include "lp_core_spi.h"
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#if CONFIG_ESPRESSIF_SPI_TEST_MODE
#  define MOSI_PIN_ATTR (OUTPUT_FUNCTION_2 | INPUT_FUNCTION_2 | PULLUP)
#  define MISO_PIN_ATTR (OUTPUT_FUNCTION_2 | INPUT_FUNCTION_2 | PULLUP)
#else
#  define MOSI_PIN_ATTR (OUTPUT_FUNCTION_2)
#  define MISO_PIN_ATTR (INPUT_FUNCTION_2 | PULLUP)
#endif

#if defined(CONFIG_ARCH_CHIP_ESP32C3)
#define SPI2_IOMUX_MISOPIN  2
#define SPI2_IOMUX_MOSIPIN  7
#define SPI2_IOMUX_CLKPIN   6
#define SPI2_IOMUX_CSPIN    10
#elif defined(CONFIG_ARCH_CHIP_ESP32C6)
#define SPI2_IOMUX_MISOPIN  2
#define SPI2_IOMUX_MOSIPIN  7
#define SPI2_IOMUX_CLKPIN   6
#define SPI2_IOMUX_CSPIN    16
#elif defined(CONFIG_ARCH_CHIP_ESP32H2)
#define SPI2_IOMUX_MISOPIN  0
#define SPI2_IOMUX_MOSIPIN  5
#define SPI2_IOMUX_CLKPIN   4
#define SPI2_IOMUX_CSPIN    1
#endif

/* Check if Chip-Select pin will be controlled via software */

#ifdef CONFIG_ESPRESSIF_SPI_SWCS
#  define SPI_HAVE_SWCS 1
#else
#  define SPI_HAVE_SWCS 0
#endif

#if defined(CONFIG_ESPRESSIF_SPI2_DMA) || defined(CONFIG_ESPRESSIF_SPI3_DMA)

/* SPI DMA RX/TX number of descriptors */

#define SPI_DMA_DESC_NUM    (CONFIG_ESPRESSIF_SPI2_DMADESC_NUM)

#endif

/* Verify whether SPI has been assigned IOMUX pins.
 * Otherwise, SPI signals will be routed via GPIO Matrix.
 */

#define SPI_IS_CS_IOMUX   (CONFIG_ESPRESSIF_SPI2_CSPIN == SPI2_IOMUX_CSPIN)
#define SPI_IS_CLK_IOMUX  (CONFIG_ESPRESSIF_SPI2_CLKPIN == SPI2_IOMUX_CLKPIN)
#define SPI_IS_MOSI_IOMUX (CONFIG_ESPRESSIF_SPI2_MOSIPIN == SPI2_IOMUX_MOSIPIN)
#define SPI_IS_MISO_IOMUX (CONFIG_ESPRESSIF_SPI2_MISOPIN == SPI2_IOMUX_MISOPIN)

#define SPI_VIA_IOMUX     ((SPI_IS_CS_IOMUX || SPI_HAVE_SWCS) && \
                           (SPI_IS_CLK_IOMUX) &&                 \
                           (SPI_IS_MOSI_IOMUX) &&                \
                           (SPI_IS_MISO_IOMUX)) ? 1 : 0

/* SPI default frequency (limited by clock divider) */

#define SPI_DEFAULT_FREQ  (4000000)

/* SPI default width */

#define SPI_DEFAULT_WIDTH (8)

/* SPI default mode */

#define SPI_DEFAULT_MODE  (SPIDEV_MODE0)

/* SPI Maximum buffer size in bytes */

#define SPI_MAX_BUF_SIZE (64)

/* SPI blank array size */

#define SPI_BLANK_ARRAY_SIZE (16)

#if SOC_PERIPH_CLK_CTRL_SHARED
#define SPI_MASTER_PERI_CLOCK_ATOMIC() PERIPH_RCC_ATOMIC()
#else
#define SPI_MASTER_PERI_CLOCK_ATOMIC()
#endif

#if defined(SOC_GDMA_BUS_AXI) && \
    (SOC_GDMA_TRIG_PERIPH_SPI2_BUS == SOC_GDMA_BUS_AXI)
#  define SPI_GDMA_NEW_CHANNEL     gdma_new_axi_channel
#elif defined(SOC_GDMA_BUS_AHB) && \
      (SOC_GDMA_TRIG_PERIPH_SPI2_BUS == SOC_GDMA_BUS_AHB)
#  define SPI_GDMA_NEW_CHANNEL    gdma_new_ahb_channel
#endif

#if SOC_GPSPI_SUPPORTED && defined(SOC_GDMA_BUS_AXI) && (SOC_GDMA_TRIG_PERIPH_SPI2_BUS == SOC_GDMA_BUS_AXI)
#  define DMA_DESC_MEM_ALIGN_SIZE 8
typedef dma_descriptor_align8_t spi_dma_desc_t;
#else
#  define DMA_DESC_MEM_ALIGN_SIZE 4
typedef dma_descriptor_align4_t spi_dma_desc_t;
#endif

#if SOC_GDMA_SUPPORTED  /* AHB_DMA_V1 and AXI_DMA */

/* DMA is provided by gdma driver on these targets */

#define spi_dma_reset               gdma_reset
#define spi_dma_start(chan, addr)   gdma_start(chan, (intptr_t)(addr))
#endif

/* peripheral hardware limitation for clock source into peripheral */

#define SPI_PERIPH_SRC_FREQ_MAX     (80*1000*1000)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* SPI Device hardware configuration */

struct esp_spi_config_s
{
  uint32_t width;              /* SPI default width */
  uint8_t  cs_pin;             /* GPIO pin for CS */
  uint8_t  mosi_pin;           /* GPIO pin for MOSI */
  uint8_t  miso_pin;           /* GPIO pin for MISO */
  uint8_t  clk_pin;            /* GPIO pin for CLK */
};

struct esp_spi_priv_s
{
  /* Externally visible part of the SPI interface */

