sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_spi.c
  struct spi_dev_s spi_dev;

  /* Port configuration */

  const struct esp_spi_config_s *config;
  int refs;                             /* Reference count */
  mutex_t lock;                         /* Held while chip is selected for mutual exclusion */
#if defined(CONFIG_ESPRESSIF_SPI2_DMA) || defined(CONFIG_ESPRESSIF_SPI3_DMA)
  sem_t sem_isr;                        /* Interrupt wait semaphore */
  int cpuint;                           /* SPI interrupt ID */
  gdma_channel_handle_t dma_channel_tx; /* SPI DMA TX channel being used */
  gdma_channel_handle_t dma_channel_rx; /* SPI DMA RX channel being used */
  int32_t dma_channel;                  /* Channel assigned by the GDMA driver */
  spi_dma_desc_t *dma_rxdesc;           /* DMA RX description */
  spi_dma_desc_t *dma_txdesc;           /* DMA TX description */
  int dma_thld;                         /* DMA threshold value */
#endif
  uint8_t nbits;                        /* Actual SPI send/receive bits once transmission */
  uint8_t id;                           /* ID number of SPI interface */
  spi_hal_context_t *ctx;               /* Context struct of common layer */
  spi_hal_dev_config_t *dev_cfg;        /* Device configuration struct of common layer */
  spi_hal_timing_param_t *timing_param; /* Timing struct of common layer */
#ifdef CONFIG_PM
  esp_pm_lock_handle_t pm_lock;         /* Power management lock */
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

#if SPI_LL_SUPPORT_CLK_SRC_PRE_DIV
static uint32_t spi_find_clock_src_pre_div(uint32_t src_freq,
                                           uint32_t target_freq);
#endif //SPI_LL_SUPPORT_CLK_SRC_PRE_DIV

#if defined(CONFIG_ESPRESSIF_SPI2_DMA) || defined(CONFIG_ESPRESSIF_SPI3_DMA)
static uint32_t spi_common_dma_setup(int chan, bool tx,
                                     spi_dma_desc_t *dmadesc, uint32_t num,
                                     uint8_t *pbuf, uint32_t len);
#endif
static int esp_spi_lock(struct spi_dev_s *dev, bool lock);
#ifndef CONFIG_ESPRESSIF_SPI_UDCS
static void esp_spi_select(struct spi_dev_s *dev,
                           uint32_t devid, bool selected);
#endif
static uint32_t esp_spi_setfrequency(struct spi_dev_s *dev,
                                     uint32_t frequency);
static void esp_spi_setmode(struct spi_dev_s *dev,
                            enum spi_mode_e mode);
static void esp_spi_setbits(struct spi_dev_s *dev, int nbits);
#ifdef CONFIG_SPI_HWFEATURES
static int esp_spi_hwfeatures(struct spi_dev_s *dev,
                              spi_hwfeatures_t features);
#endif
static uint32_t esp_spi_send(struct spi_dev_s *dev, uint32_t wd);
static void esp_spi_exchange(struct spi_dev_s *dev,
                             const void *txbuffer,
                             void *rxbuffer, size_t nwords);
#if defined(CONFIG_ESPRESSIF_SPI2_DMA) || defined(CONFIG_ESPRESSIF_SPI3_DMA)
static int esp_spi_interrupt(int irq, void *context, void *arg);
static int esp_spi_sem_waitdone(struct esp_spi_priv_s *priv);
static void esp_spi_dma_exchange(struct esp_spi_priv_s *priv,
                                     const void *txbuffer,
                                     void *rxbuffer,
                                     uint32_t nwords);
#else
static void esp_spi_poll_exchange(struct esp_spi_priv_s *priv,
                                  const void *txbuffer,
                                  void *rxbuffer,
                                  size_t nwords);
#endif
#ifndef CONFIG_SPI_EXCHANGE
static void esp_spi_sndblock(struct spi_dev_s *dev,
                             const void *txbuffer,
                             size_t nwords);
static void esp_spi_recvblock(struct spi_dev_s *dev,
                              void *rxbuffer,
                              size_t nwords);
#endif
#ifdef CONFIG_SPI_TRIGGER
static int esp_spi_trigger(struct spi_dev_s *dev);
#endif
#if defined(CONFIG_ESPRESSIF_SPI2_DMA) || defined(CONFIG_ESPRESSIF_SPI3_DMA)
static void esp_spi_dma_init(struct spi_dev_s *dev);
#endif
static void esp_spi_init(struct spi_dev_s *dev);
static void esp_spi_deinit(struct spi_dev_s *dev);

/****************************************************************************
 * Private Data
 ****************************************************************************/

#ifdef CONFIG_ESPRESSIF_SPI2

#if defined(CONFIG_ESPRESSIF_SPI2_DMA) || defined(CONFIG_ESPRESSIF_SPI3_DMA)

/* SPI DMA RX/TX description */

static spi_dma_desc_t dma_rxdesc[CONFIG_ESPRESSIF_SPI2_DMADESC_NUM];
static spi_dma_desc_t dma_txdesc[CONFIG_ESPRESSIF_SPI2_DMADESC_NUM];

#endif

static spi_hal_context_t ctx =
{
    0
};

static spi_hal_dev_config_t dev_cfg  =
{
    .mode = SPI_DEFAULT_MODE,
    .cs_setup = 0,
    .cs_hold = 0,
    .cs_pin_id = 0,
    .timing_conf =
    {
      0
    },
    {
      0
    }
};

static spi_hal_timing_param_t timing_param =
{
    .no_compensate = 0,
    .half_duplex = 0,
    .input_delay_ns = 0,
#ifdef SPI_VIA_IOMUX
    .use_gpio = 0,
#else
    .use_gpio = 1,
#endif
    .duty_cycle = 128,
    .clk_src_hz = 0,
    .expected_freq = SPI_DEFAULT_FREQ,
};

static const struct esp_spi_config_s esp_spi2_config =
{
  .width        = SPI_DEFAULT_WIDTH,
  .cs_pin       = CONFIG_ESPRESSIF_SPI2_CSPIN,
  .mosi_pin     = CONFIG_ESPRESSIF_SPI2_MOSIPIN,
  .miso_pin     = CONFIG_ESPRESSIF_SPI2_MISOPIN,
  .clk_pin      = CONFIG_ESPRESSIF_SPI2_CLKPIN,
};

static const struct spi_ops_s esp_spi2_ops =
{
  .lock              = esp_spi_lock,
#ifdef CONFIG_ESPRESSIF_SPI_UDCS
  .select            = esp_spi2_select,
#else
  .select            = esp_spi_select,
#endif
  .setfrequency      = esp_spi_setfrequency,
  .setmode           = esp_spi_setmode,
  .setbits           = esp_spi_setbits,
#ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = esp_spi_hwfeatures,
#endif
  .status            = esp_spi2_status,
#ifdef CONFIG_SPI_CMDDATA
  .cmddata           = esp_spi2_cmddata,
#endif
  .send              = esp_spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange          = esp_spi_exchange,
#else
  .sndblock          = esp_spi_sndblock,
  .recvblock         = esp_spi_recvblock,
#endif
#ifdef CONFIG_SPI_TRIGGER
  .trigger           = esp_spi_trigger,
#endif
  .registercallback  = NULL,
};

static struct esp_spi_priv_s esp_spi2_priv =
{
  .spi_dev      =
  {
    .ops        = &esp_spi2_ops
  },
  .config       = &esp_spi2_config,
  .refs         = 0,
  .lock         = NXMUTEX_INITIALIZER,
  .id           = SPI2_HOST,
  .nbits        = 0,
  .dev_cfg      = &dev_cfg,
  .ctx          = &ctx,
  .timing_param = &timing_param,
#if defined(CONFIG_ESPRESSIF_SPI2_DMA) || defined(CONFIG_ESPRESSIF_SPI3_DMA)
  .sem_isr      = SEM_INITIALIZER(0),
  .cpuint       = -ENOMEM,
  .dma_channel  = CONFIG_ESPRESSIF_SPI2_DMADESC_NUM,
  .dma_rxdesc   = dma_rxdesc,
  .dma_txdesc   = dma_txdesc,
  .dma_thld     = CONFIG_ESPRESSIF_SPI2_DMATHRESHOLD,
#endif
#ifdef CONFIG_PM
  .pm_lock      = NULL,
#endif
};
#endif /* CONFIG_ESPRESSIF_SPI2 */

#ifdef CONFIG_ESPRESSIF_SPI3

#ifdef CONFIG_ESPRESSIF_SPI3_DMA

/* SPI DMA RX/TX description */

static spi_dma_desc_t spi3_dma_rxdesc[CONFIG_ESPRESSIF_SPI3_DMADESC_NUM];
static spi_dma_desc_t spi3_dma_txdesc[CONFIG_ESPRESSIF_SPI3_DMADESC_NUM];

#endif

static spi_hal_context_t spi3_ctx =
{
    0
};

static spi_hal_dev_config_t spi3_dev_cfg  =
{
    .mode = SPI_DEFAULT_MODE,
    .cs_setup = 0,
    .cs_hold = 0,
    .cs_pin_id = 0,
    .timing_conf =
    {
      0
    },
    {
      0
    }
};

static spi_hal_timing_param_t spi3_timing_param =
{
    .no_compensate = 0,
    .half_duplex = 0,
    .input_delay_ns = 0,
    .use_gpio = 1,
    .duty_cycle = 128,
    .clk_src_hz = 0,
    .expected_freq = SPI_DEFAULT_FREQ,
};

static const struct esp_spi_config_s esp_spi3_config =
{
  .width        = SPI_DEFAULT_WIDTH,
  .cs_pin       = CONFIG_ESPRESSIF_SPI3_CSPIN,
  .mosi_pin     = CONFIG_ESPRESSIF_SPI3_MOSIPIN,
  .miso_pin     = CONFIG_ESPRESSIF_SPI3_MISOPIN,
  .clk_pin      = CONFIG_ESPRESSIF_SPI3_CLKPIN,
};

static const struct spi_ops_s esp_spi3_ops =
{
  .lock              = esp_spi_lock,
#ifdef CONFIG_ESPRESSIF_SPI_UDCS
  .select            = esp_spi3_select,
#else
  .select            = esp_spi_select,
#endif
  .setfrequency      = esp_spi_setfrequency,
  .setmode           = esp_spi_setmode,
  .setbits           = esp_spi_setbits,
#ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = esp_spi_hwfeatures,
#endif
  .status            = esp_spi3_status,
#ifdef CONFIG_SPI_CMDDATA
  .cmddata           = esp_spi3_cmddata,
#endif
  .send              = esp_spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange          = esp_spi_exchange,
#else
  .sndblock          = esp_spi_sndblock,
  .recvblock         = esp_spi_recvblock,
#endif
#ifdef CONFIG_SPI_TRIGGER
  .trigger           = esp_spi_trigger,
#endif
  .registercallback  = NULL,
};

static struct esp_spi_priv_s esp_spi3_priv =
{
  .spi_dev      =
  {
    .ops        = &esp_spi3_ops
  },
  .config       = &esp_spi3_config,
  .refs         = 0,
  .lock         = NXMUTEX_INITIALIZER,
  .id           = SPI3_HOST,
  .nbits        = 0,
  .dev_cfg      = &spi3_dev_cfg,
  .ctx          = &spi3_ctx,
  .timing_param = &spi3_timing_param,
#ifdef CONFIG_ESPRESSIF_SPI3_DMA
  .sem_isr      = SEM_INITIALIZER(0),
  .cpuint       = -ENOMEM,
  .dma_channel  = CONFIG_ESPRESSIF_SPI3_DMADESC_NUM,
  .dma_rxdesc   = spi3_dma_rxdesc,
  .dma_txdesc   = spi3_dma_txdesc,
  .dma_thld     = CONFIG_ESPRESSIF_SPI3_DMATHRESHOLD,
#endif
#ifdef CONFIG_PM
  .pm_lock      = NULL,
#endif
};
#endif /* CONFIG_ESPRESSIF_SPI3 */

#ifdef CONFIG_ESPRESSIF_LPSPI0
static const struct esp_spi_config_s esp_lpspi_config =
{
  .width        = SPI_DEFAULT_WIDTH,
  .cs_pin       = CONFIG_ESPRESSIF_LPSPI0_CSPIN,
  .mosi_pin     = CONFIG_ESPRESSIF_LPSPI0_MOSIPIN,
  .miso_pin     = CONFIG_ESPRESSIF_LPSPI0_MISOPIN,
  .clk_pin      = CONFIG_ESPRESSIF_LPSPI0_CLKPIN,
};

static struct esp_spi_priv_s esp_lpspi_priv =
{
  .spi_dev      =
  {
    .ops        = NULL
  },
  .config       = &esp_lpspi_config,
  .refs         = 0,
  .lock         = NXMUTEX_INITIALIZER,
  .id           = 0,
  .nbits        = 0,
  .dev_cfg      = NULL,
  .ctx          = NULL,
  .timing_param = NULL,
#ifdef CONFIG_PM
  .pm_lock      = NULL,
#endif
};

static lp_spi_device_config_t esp_lpspi_device_config =
{
  .cs_io_num = CONFIG_ESPRESSIF_LPSPI0_CSPIN,
  .clock_speed_hz = SPI_DEFAULT_FREQ / 4,
  .duty_cycle = 128,
};

#endif

/* Blank array to fill the send buffer */

static uint32_t blank_arr[SPI_BLANK_ARRAY_SIZE];

/****************************************************************************
 * Private Functions
 ****************************************************************************/

