sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_spi.c
#if SPI_LL_SUPPORT_CLK_SRC_PRE_DIV
static uint32_t spi_find_clock_src_pre_div(uint32_t src_freq,
                                           uint32_t target_freq)
{
  /* pre division must be even and at least 2 */

  uint32_t total_div;
  uint32_t pre_div;
  uint32_t min_div = ((src_freq / SPI_PERIPH_SRC_FREQ_MAX) + 1) & (~0x01ul);

  min_div = min_div < 2 ? 2 : min_div;

  total_div = src_freq / target_freq;

  /* Loop the `div` to find a divisible value of `total_div` */

  for (pre_div = min_div;
       pre_div <= MIN(total_div, SPI_LL_SRC_PRE_DIV_MAX);
       pre_div += 2)
    {
      if ((total_div % pre_div) ||
          (total_div / pre_div) > SPI_LL_PERIPH_CLK_DIV_MAX)
        {
          continue;
        }

      return pre_div;
    }

  return min_div;
}
#endif //SPI_LL_SUPPORT_CLK_SRC_PRE_DIV

/****************************************************************************
 * Name: spi_common_dma_setup
 *
 * Description:
 *   Set up DMA descriptor with given parameters.
 *
 * Input Parameters:
 *   chan    - DMA channel
 *   tx      - true: TX mode; false: RX mode
 *   dmadesc - DMA descriptor pointer
 *   num     - DMA descriptor number
 *   pbuf    - Buffer pointer
 *   len     - Buffer length by byte
 *
 * Returned Value:
 *   Bind pbuf data bytes.
 *
 ****************************************************************************/

#if defined(CONFIG_ESPRESSIF_SPI2_DMA) || defined(CONFIG_ESPRESSIF_SPI3_DMA)
static uint32_t spi_common_dma_setup(int chan, bool tx,
                                     spi_dma_desc_t *dmadesc, uint32_t num,
                                     uint8_t *pbuf, uint32_t len)
{
  int i;
  uint32_t regval;
  uint32_t bytes = len;
  uint8_t *pdata = pbuf;
  uint32_t data_len;
  uint32_t buf_len;
  gdma_channel_direction_t dir = tx == true ? GDMA_CHANNEL_DIRECTION_TX : \
                                              GDMA_CHANNEL_DIRECTION_RX;
  spi_dma_desc_t *dma_desc = (spi_dma_desc_t *)dmadesc;

  DEBUGASSERT(chan >= 0);
  DEBUGASSERT(dmadesc != NULL);
  DEBUGASSERT(num > 0);
  DEBUGASSERT(pbuf != NULL);
  DEBUGASSERT(len > 0);

  for (i = 0; i < num; i++)
    {
      data_len = MIN(bytes, DMA_DESCRIPTOR_BUFFER_MAX_SIZE_4B_ALIGNED);

      /* Buffer length must be rounded to next 32-bit boundary. */

      buf_len = ALIGN_UP(data_len, sizeof(uintptr_t));

      dma_desc[i].dw0.size = buf_len;
      dma_desc[i].dw0.length = tx ? data_len : 0;
      dma_desc[i].dw0.owner = DMA_DESCRIPTOR_BUFFER_OWNER_DMA;
      dma_desc[i].buffer = pdata;

      dma_desc[i].next = &dma_desc[i + 1];

#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
      esp_cache_msync(&dma_desc[i], sizeof(dma_descriptor_t),
                      ESP_CACHE_MSYNC_FLAG_DIR_C2M | \
                      ESP_CACHE_MSYNC_FLAG_UNALIGNED);
#endif

      bytes -= data_len;

      if (bytes == 0)
        {
          break;
        }

      pdata += data_len;
    }

  dma_desc[i].dw0.suc_eof = tx ? 1 : 0;
  dma_desc[i].next = NULL;

#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
  esp_cache_msync(&dma_desc[i], sizeof(dma_descriptor_t),
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M | \
                  ESP_CACHE_MSYNC_FLAG_UNALIGNED);
#endif

  return len - bytes;
}
#endif

/****************************************************************************
 * Name: esp_spi_lock
 *
 * Description:
 *   Lock or unlock the SPI device.
 *
 * Input Parameters:
 *   dev  - Device-specific state data
 *   lock - true: Lock SPI bus, false: unlock SPI bus
 *
 * Returned Value:
 *   The result of lock or unlock the SPI device.
 *
 ****************************************************************************/

static int esp_spi_lock(struct spi_dev_s *dev, bool lock)
{
  int ret;
  struct esp_spi_priv_s *priv = (struct esp_spi_priv_s *)dev;

  if (lock)
    {
      ret = nxmutex_lock(&priv->lock);
    }
  else
    {
      ret = nxmutex_unlock(&priv->lock);
    }

  return ret;
}

/****************************************************************************
 * Name: esp_spi_sem_waitdone
 *
 * Description:
 *   Wait for a transfer to complete.
 *
 * Input Parameters:
 *   priv - SPI private state data
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#if defined(CONFIG_ESPRESSIF_SPI2_DMA) || defined(CONFIG_ESPRESSIF_SPI3_DMA)
static int esp_spi_sem_waitdone(struct esp_spi_priv_s *priv)
{
  return nxsem_tickwait_uninterruptible(&priv->sem_isr, SEC2TICK(10));
}
#endif

/****************************************************************************
 * Name: esp_spi_select
 *
 * Description:
 *   Enable/disable the SPI chip select. The implementation of this method
 *   must include handshaking: If a device is selected, it must hold off
 *   all other attempts to select the device until the device is deselected.
 *
 *   If ESPRESSIF_SPI_SWCS is disabled, the driver will use hardware CS so
 *   that once transmission is started the hardware selects the device and
 *   when this transmission is done hardware deselects the device
 *   automatically.
 *   So, this function will do nothing.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   devid    - Identifies the device to select
 *   selected - true: slave selected, false: slave de-selected
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#ifndef CONFIG_ESPRESSIF_SPI_UDCS
static void esp_spi_select(struct spi_dev_s *dev,
                           uint32_t devid, bool selected)
{
#if SPI_HAVE_SWCS
  struct esp_spi_priv_s *priv = (struct esp_spi_priv_s *)dev;
  bool value = selected ? false : true;

  esp_gpiowrite(priv->config->cs_pin, value);
#endif

  spiinfo("devid: %08" PRIx32 " CS: %s\n",
          devid, selected ? "select" : "free");
}
#endif

/****************************************************************************
 * Name: esp_spi_setfrequency
 *
 * Description:
 *   Set the SPI frequency.
 *
 * Input Parameters:
 *   dev       - Device-specific state data
 *   frequency - The requested SPI frequency
 *
 * Returned Value:
 *   Returns the current selected frequency.
 *
 ****************************************************************************/

static uint32_t esp_spi_setfrequency(struct spi_dev_s *dev,
                                     uint32_t frequency)
{
  struct esp_spi_priv_s *priv = (struct esp_spi_priv_s *)dev;
  spi_hal_timing_conf_t temp_timing_conf;
  uint32_t clock_source_hz = 0;
  uint32_t clock_source_div = 1;

  esp_clk_tree_enable_src(SPI_CLK_SRC_DEFAULT, true);
  esp_clk_tree_src_get_freq_hz(SPI_CLK_SRC_DEFAULT,
                               ESP_CLK_TREE_SRC_FREQ_PRECISION_CACHED,
                               &clock_source_hz);

  if (priv->dev_cfg->timing_conf.real_freq == frequency)
    {
      /* Requested frequency is the same as the current frequency. */

      return priv->dev_cfg->timing_conf.real_freq;
    }

