sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_spi.c
#if SPI_LL_SUPPORT_CLK_SRC_PRE_DIV
  clock_source_div = spi_find_clock_src_pre_div(clock_source_hz,
                                                SPI_DEFAULT_FREQ);
  clock_source_hz /= clock_source_div; /* actual freq enter to SPI peripheral */
#endif

  priv->timing_param->clk_src_hz = clock_source_hz;
  priv->timing_param->expected_freq = frequency;

  spi_hal_cal_clock_conf(priv->timing_param, &temp_timing_conf);

  temp_timing_conf.clock_source = SPI_CLK_SRC_DEFAULT;
  temp_timing_conf.source_pre_div = clock_source_div;
  temp_timing_conf.source_real_freq = clock_source_hz;

  priv->dev_cfg->timing_conf = temp_timing_conf;

  spi_hal_setup_device(priv->ctx, priv->dev_cfg);

  SPI_MASTER_PERI_CLOCK_ATOMIC()
    {
#if SPI_LL_SUPPORT_CLK_SRC_PRE_DIV

      /* We set mst_div as const 2, then (hs_clk = 2*mst_clk) to ensure
       * timing turning work as past and ensure
       * (hs_div * mst_div = source_pre_div)
       */

      spi_ll_clk_source_pre_div(priv->ctx->hw,
                                clock_source_div / 2, 2);
#endif
      spi_ll_set_clk_source(priv->ctx->hw,
                            priv->dev_cfg->timing_conf.clock_source);
    }

  spiinfo("frequency=%" PRIu32 ", actual=%d\n",
          priv->timing_param->expected_freq,
          priv->dev_cfg->timing_conf.real_freq);

  return priv->dev_cfg->timing_conf.real_freq;
}

/****************************************************************************
 * Name: esp_spi_setmode
 *
 * Description:
 *   Set the SPI mode.
 *
 * Input Parameters:
 *   dev  - Device-specific state data
 *   mode - The requested SPI mode
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp_spi_setmode(struct spi_dev_s *dev, enum spi_mode_e mode)
{
  struct esp_spi_priv_s *priv = (struct esp_spi_priv_s *)dev;

  spiinfo("mode=%d\n", mode);

  /* Has the mode changed? */

  if (mode != priv->dev_cfg->mode)
    {
      if (mode > SPIDEV_MODE3 || mode < SPIDEV_MODE0)
        {
          spierr("Invalid mode: %d\n", mode);
          DEBUGPANIC();
          return;
        }
      else
        {
          spi_ll_master_set_mode(priv->ctx->hw, mode);
        }

      priv->dev_cfg->mode = mode;
    }
}

/****************************************************************************
 * Name: esp_spi_setbits
 *
 * Description:
 *   Set the number of bits per word.
 *
 * Input Parameters:
 *   dev   - Device-specific state data
 *   nbits - The number of bits in an SPI word.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp_spi_setbits(struct spi_dev_s *dev, int nbits)
{
  struct esp_spi_priv_s *priv = (struct esp_spi_priv_s *)dev;

  spiinfo("nbits=%d\n", nbits);

  priv->nbits = nbits;
}

/****************************************************************************
 * Name: esp_spi_hwfeatures
 *
 * Description:
 *   Set hardware-specific feature flags.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   features - H/W feature flags
 *
 * Returned Value:
 *   Zero (OK) if the selected H/W features are enabled; A negated errno
 *   value if any H/W feature is not supportable.
 *
 ****************************************************************************/

#ifdef CONFIG_SPI_HWFEATURES
static int esp_spi_hwfeatures(struct spi_dev_s *dev,
                              spi_hwfeatures_t features)
{
  /* Other H/W features are not supported */

  return (features == 0) ? OK : -ENOSYS;
}
#endif

/****************************************************************************
 * Name: esp_spi_dma_exchange
 *
 * Description:
 *   Exchange a block of data from SPI by DMA.
 *
 * Input Parameters:
 *   priv     - SPI private state data
 *   txbuffer - A pointer to the buffer of data to be sent
 *   rxbuffer - A pointer to the buffer in which to receive data
 *   nwords   - the length of data that to be exchanged in units of words.
 *              The wordsize is determined by the number of bits-per-word
 *              selected for the SPI interface.  If nbits <= 8, the data is
 *              packed into uint8_t's; if nbits >8, the data is packed into
 *              uint16_t's
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#if defined(CONFIG_ESPRESSIF_SPI2_DMA) || defined(CONFIG_ESPRESSIF_SPI3_DMA)
static void esp_spi_dma_exchange(struct esp_spi_priv_s *priv,
                                     const void *txbuffer,
                                     void *rxbuffer,
                                     uint32_t nwords)
{
  const uint32_t total = nwords * ((priv->nbits + 7) / 8);
  uint32_t tx_byte_len;
  uint32_t rx_byte_len;
  int tx_dma_channel_id;
  int rx_dma_channel_id;
  uint32_t n;
  uint16_t alignment;
  uint32_t bytes = total;
  uint8_t *txbuffer_temp;
  uint8_t *rxbuffer_temp;
  uint8_t *tp;
  uint8_t *rp;
  spi_hal_trans_config_t trans =
    {
      0
    };

#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
  bool tx_unaligned;
  bool rx_unaligned;
#else
  bool tx_unaligned;
  bool rx_unaligned;
#endif
  bool tx_realoc = false;
  bool rx_realoc = false;

  if (txbuffer == NULL)
    {
      txbuffer = rxbuffer;
    }

#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
  esp_cache_get_alignment(MALLOC_CAP_DMA, (size_t *)&alignment);
#else
  alignment = 4;
#endif

#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
  tx_unaligned = ((((uint32_t)txbuffer) | total) & (alignment - 1));
  rx_unaligned = ((((uint32_t)rxbuffer) | total) & (alignment - 1));
#else
  tx_unaligned = false;   /* tx don't need align on addr or length, for other chips */
  rx_unaligned = (((uint32_t)rxbuffer) & (alignment - 1));
#endif

  gdma_get_group_channel_id(priv->dma_channel_tx, NULL, &tx_dma_channel_id);
  gdma_get_group_channel_id(priv->dma_channel_rx, NULL, &rx_dma_channel_id);

  spiinfo("tx_dma_channel_id: %d, rx_dma_channel_id: %d\n",
          tx_dma_channel_id, rx_dma_channel_id);

  if ((!esp_ptr_dma_capable(txbuffer) || tx_unaligned))
    {
      /* If txbuf in the desc not DMA-capable, or not bytes aligned to
       * alignment, malloc a new one.
       */

      spiinfo("Allocate TX buffer for DMA");

      /* Up align alignment */

