sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_spi.c
      tx_byte_len = (total + alignment - 1) & (~(alignment - 1));
      uint32_t *temp = kmm_memalign(alignment, tx_byte_len);

      memcpy(temp, txbuffer, tx_byte_len);
      txbuffer_temp = (uint8_t *)temp;
      tp = txbuffer_temp;
      tx_realoc = true;
    }
  else
    {
      tx_byte_len = total;
      txbuffer_temp = (uint8_t *)txbuffer;
      tp = txbuffer_temp;
    }

#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
  esp_err_t ret = esp_cache_msync((void *)txbuffer_temp,
                                  tx_byte_len, ESP_CACHE_MSYNC_FLAG_DIR_C2M);
  assert(ret == ESP_OK);
#endif

  if ((!esp_ptr_dma_capable(rxbuffer) || rx_unaligned))
    {
      uint32_t *temp;

      /* If rxbuffer in the desc is not DMA-capable, or not aligned to the
       * required alignment, allocate a new one
       */

      spiinfo("Allocate RX buffer for DMA");
      rx_byte_len = (total + alignment - 1) & (~(alignment - 1));
      temp = kmm_memalign(alignment, rx_byte_len);

      memcpy(temp, rxbuffer, rx_byte_len);
      rxbuffer_temp = (uint8_t *)temp;
      rp = rxbuffer_temp;
      rx_realoc = true;
    }
  else
    {
      rx_byte_len = total;
      rxbuffer_temp = (uint8_t *)rxbuffer;
      rp = rxbuffer_temp;
    }

#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
  /* Invalidate here to hold on cache status to avoid hardware auto-write
   * back during dma transaction
   */

  ret = esp_cache_msync((void *)rxbuffer_temp,
                        rx_byte_len, ESP_CACHE_MSYNC_FLAG_DIR_M2C);
  assert(ret == ESP_OK);
#endif

  trans.cs_keep_active = priv->dev_cfg->cs_hold;
  trans.line_mode.data_lines = 1;
  trans.line_mode.addr_lines = 1;
  trans.line_mode.cmd_lines = 1;
  trans.rcv_buffer = (uint8_t *)rp;
  trans.send_buffer = (uint8_t *)tp;
  priv->ctx->trans_config = trans;

  spi_hal_setup_trans(priv->ctx, priv->dev_cfg, &trans);

  spi_hal_setup_device(priv->ctx, priv->dev_cfg);

  while (bytes != 0)
    {
      n = spi_common_dma_setup(tx_dma_channel_id, true, priv->dma_txdesc,
                               priv->dma_channel, tp, bytes);

      trans.tx_bitlen = n * 8;
      trans.rx_bitlen = n * 8;
      trans.rcv_buffer = (uint8_t *)rp;
      trans.send_buffer = (uint8_t *)tp;

      spi_hal_setup_trans(priv->ctx, priv->dev_cfg, &trans);

      spi_hal_setup_device(priv->ctx, priv->dev_cfg);

      /* Reset SPI DMA TX FIFO */

      spi_dma_reset(priv->dma_channel_tx);

      spi_hal_hw_prepare_tx(priv->ctx->hw);

      spi_dma_start(priv->dma_channel_tx, priv->dma_txdesc);

      spi_ll_enable_mosi(priv->ctx->hw, true);

      tp += n;

      if (rp != NULL)
        {
          /* Enable SPI DMA RX */

          spi_common_dma_setup(rx_dma_channel_id, false, priv->dma_rxdesc,
                               priv->dma_channel, rp, bytes);

          spi_dma_reset(priv->dma_channel_rx);

          spi_hal_hw_prepare_rx(priv->ctx->hw);

          spi_dma_start(priv->dma_channel_rx, priv->dma_rxdesc);

          spi_ll_enable_miso(priv->ctx->hw, true);

          rp += n;
        }
      else
        {
          spi_ll_enable_miso(priv->ctx->hw, false);
        }

      spi_hal_user_start(priv->ctx);

      esp_spi_sem_waitdone(priv);

      bytes -= n;
    }

#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
  ret = esp_cache_msync((void *)rxbuffer_temp,
                        rx_byte_len, ESP_CACHE_MSYNC_FLAG_DIR_M2C);
#endif

  if (tx_realoc)
    {
      kmm_free(txbuffer_temp);
    }

  if (rx_realoc)
    {
      memcpy(rxbuffer, rxbuffer_temp, rx_byte_len);
      kmm_free(rxbuffer_temp);
    }

  spi_ll_clear_int_stat(priv->ctx->hw);
}
#endif

/****************************************************************************
 * Name: esp_spi_poll_send
 *
 * Description:
 *   Send one word on SPI by polling mode.
 *
 * Input Parameters:
 *   priv - SPI private state data
 *   wd   - The word to send. The size of the data is determined by the
 *          number of bits selected for the SPI interface.
 *
 * Returned Value:
 *   Received value.
 *
 ****************************************************************************/

static uint32_t esp_spi_poll_send(struct esp_spi_priv_s *priv, uint32_t wd)
{
  uint32_t val;
  spi_hal_dev_config_t *hal_dev = priv->dev_cfg;
  spi_hal_trans_config_t trans =
    {
      0
    };

  trans.tx_bitlen = priv->nbits;
  trans.rx_bitlen = priv->nbits;
  trans.rcv_buffer = (uint8_t *)&val;
  trans.send_buffer = (uint8_t *)&wd;
  trans.cs_keep_active = priv->dev_cfg->cs_hold;
  trans.line_mode.data_lines = 1;
  trans.line_mode.addr_lines = 0;
  trans.line_mode.cmd_lines = 0;
  priv->ctx->trans_config = trans;

  spi_hal_setup_trans(priv->ctx, priv->dev_cfg, &trans);
  spi_hal_push_tx_buffer(priv->ctx, &trans);
  spi_hal_enable_data_line(priv->ctx->hw,
                           (!hal_dev->half_duplex && trans.rcv_buffer) \
                            || trans.send_buffer, !!trans.rcv_buffer);

  spi_hal_user_start(priv->ctx);

  while (!spi_hal_usr_is_done(priv->ctx));
  spi_hal_fetch_result(priv->ctx);

  spiinfo("send=0x%" PRIx32 " and recv=0x%" PRIx32 "\n", wd, val);

  return val;
}

/****************************************************************************
 * Name: esp_spi_send
 *
 * Description:
 *   Send one word on SPI.
 *
 * Input Parameters:
 *   dev - Device-specific state data
 *   wd  - The word to send. The size of the data is determined by the
 *         number of bits selected for the SPI interface.
 *
 * Returned Value:
 *   Received value.
 *
 ****************************************************************************/

static uint32_t esp_spi_send(struct spi_dev_s *dev, uint32_t wd)
{
  struct esp_spi_priv_s *priv = (struct esp_spi_priv_s *)dev;
  int ret;

#ifdef CONFIG_PM
  esp_pm_lock_acquire(priv->pm_lock);
#endif
  ret = esp_spi_poll_send(priv, wd);
#ifdef CONFIG_PM
  esp_pm_lock_release(priv->pm_lock);
#endif

  return ret;
}

/****************************************************************************
 * Name: esp_spi_poll_exchange
 *
 * Description:
 *   Exchange a block of data from SPI.
 *
 * Input Parameters:
 *   priv     - SPI private state data
 *   txbuffer - A pointer to the buffer of data to be sent
 *   rxbuffer - A pointer to the buffer in which to receive data
 *   nwords   - The length of data that to be exchanged in units of words.
 *              The wordsize is determined by the number of bits-per-word
 *              selected for the SPI interface. If nbits <= 8, the data is
 *              packed into uint8_t's; if nbits >8, the data is packed into
 *              uint16_t's
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp_spi_poll_exchange(struct esp_spi_priv_s *priv,
                                  const void *txbuffer,
                                  void *rxbuffer,
                                  size_t nwords)
{
  const uint32_t total_bytes = nwords * (priv->nbits / 8);
  uintptr_t bytes_remaining = total_bytes;
  uint8_t *tp = (uint8_t *)txbuffer;
  uint8_t *rp = (uint8_t *)rxbuffer;
  spi_hal_trans_config_t trans =
    {
      0
    };

