sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_spi.c
  trans.cs_keep_active = priv->dev_cfg->cs_hold;
  trans.line_mode.data_lines = 1;
  trans.line_mode.addr_lines = 0;
  trans.line_mode.cmd_lines = 0;

  while (bytes_remaining != 0)
    {
      uint32_t transfer_size = MIN(SPI_MAX_BUF_SIZE, bytes_remaining);

      /* Write data words to data buffer registers.
       * SPI peripheral contains 16 registers (W0 - W15)
       * allowing up to 64 bytes to be sent or received at one time.
       */

      trans.tx_bitlen = transfer_size * 8;
      trans.rx_bitlen = transfer_size * 8;
      trans.rcv_buffer = (uint8_t *)rp;
      priv->ctx->trans_config = trans;

      if (tp == NULL)
        {
          /* Write 0xffffffff to fill the send buffer */

          trans.send_buffer = (uint8_t *)blank_arr;
          spiinfo("send %" PRIu32 " bytes value=0x%" PRIx32 "\n",
                  transfer_size, blank_arr[0]);
        }
      else
        {
          trans.send_buffer = (uint8_t *)tp;
          spiinfo("send %" PRIu32 " bytes addr=0x%p\n",
                  transfer_size, tp);
        }

      spi_hal_setup_trans(priv->ctx, priv->dev_cfg, &trans);
      spi_hal_push_tx_buffer(priv->ctx, &trans);
      spi_hal_user_start(priv->ctx);
      spi_hal_enable_data_line(priv->ctx->hw,
                               (!priv->timing_param->half_duplex && \
                                trans.rcv_buffer) || trans.send_buffer,
                               !!trans.rcv_buffer);

      while (!spi_hal_usr_is_done(priv->ctx));

      if (rp != NULL)
        {
          spi_hal_fetch_result(priv->ctx);
          spiinfo("recv %" PRIu32 " bytes addr=0x%p\n",
                  transfer_size, rp);
          rp += transfer_size;
        }

      if (tp != NULL)
        {
          tp += transfer_size;
        }

      bytes_remaining -= transfer_size;
    }
}

/****************************************************************************
 * Name: esp_spi_exchange
 *
 * Description:
 *   Exchange a block of data from SPI.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   txbuffer - A pointer to the buffer of data to be sent
 *   rxbuffer - A pointer to the buffer in which to receive data
 *   nwords   - The length of data that to be exchanged in units of words.
 *              The wordsize is determined by the number of bits-per-word
 *              selected for the SPI interface. If nbits <= 8, the data is
 *              packed into uint8_t's; if nbits >8, the data is packed into
 *              uint16_t's
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp_spi_exchange(struct spi_dev_s *dev,
                             const void *txbuffer,
                             void *rxbuffer,
                             size_t nwords)
{
  struct esp_spi_priv_s *priv = (struct esp_spi_priv_s *)dev;

#ifdef CONFIG_PM
  esp_pm_lock_acquire(priv->pm_lock);
#endif
#if defined(CONFIG_ESPRESSIF_SPI2_DMA) || defined(CONFIG_ESPRESSIF_SPI3_DMA)
  size_t thld = priv->dma_thld;

  if (nwords > thld)
    {
      esp_spi_dma_exchange(priv, txbuffer, rxbuffer, nwords);
    }
  else
#endif
    {
      esp_spi_poll_exchange(priv, txbuffer, rxbuffer, nwords);
    }

#ifdef CONFIG_PM
  esp_pm_lock_release(priv->pm_lock);
#endif
}

#ifndef CONFIG_SPI_EXCHANGE

/****************************************************************************
 * Name: esp_spi_sndblock
 *
 * Description:
 *   Send a block of data on SPI.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   txbuffer - A pointer to the buffer of data to be sent
 *   nwords   - The length of data to send from the buffer in number of
 *              words. The wordsize is determined by the number of
 *              bits-per-word selected for the SPI interface. If nbits <= 8,
 *              the data is packed into uint8_t's; if nbits >8, the data is
 *              packed into uint16_t's
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp_spi_sndblock(struct spi_dev_s *dev,
                             const void *txbuffer,
                             size_t nwords)
{
  spiinfo("txbuffer=%p nwords=%d\n", txbuffer, nwords);

  esp_spi_exchange(dev, txbuffer, NULL, nwords);
}

/****************************************************************************
 * Name: esp_spi_recvblock
 *
 * Description:
 *   Receive a block of data from SPI.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   rxbuffer - A pointer to the buffer in which to receive data
 *   nwords   - The length of data that can be received in the buffer in
 *              number of words. The wordsize is determined by the number of
 *              bits-per-word selected for the SPI interface. If nbits <= 8,
 *              the data is packed into uint8_t's; if nbits >8, the data is
 *              packed into uint16_t's
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp_spi_recvblock(struct spi_dev_s *dev,
                              void *rxbuffer,
                              size_t nwords)
{
  spiinfo("rxbuffer=%p nwords=%d\n", rxbuffer, nwords);

  esp_spi_exchange(dev, NULL, rxbuffer, nwords);
}
#endif

/****************************************************************************
 * Name: esp_spi_trigger
 *
 * Description:
 *   Trigger a previously configured DMA transfer.
 *
 * Input Parameters:
 *   dev - Device-specific state data
 *
 * Returned Value:
 *   -OK     - Trigger was fired
 *   -ENOSYS - Trigger not fired due to lack of DMA or low level support
 *   -EIO    - Trigger not fired because not previously primed
 *
 ****************************************************************************/

#ifdef CONFIG_SPI_TRIGGER
static int esp_spi_trigger(struct spi_dev_s *dev)
{
  return -ENOSYS;
}
#endif

/****************************************************************************
 * Name: esp_spi_dma_init
 *
 * Description:
 *   Initialize SPI connection to GDMA engine.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

