sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_spi.c
#if defined(CONFIG_ESPRESSIF_SPI2_DMA) || defined(CONFIG_ESPRESSIF_SPI3_DMA)
void esp_spi_dma_init(struct spi_dev_s *dev)
{
  struct esp_spi_priv_s *priv = (struct esp_spi_priv_s *)dev;
  gdma_channel_alloc_config_t tx_handle =
    {
      0
    };

  gdma_channel_alloc_config_t rx_handle =
    {
      0
    };

  gdma_trigger_t periph_trigger;

  /* Request a GDMA channel for SPI peripheral */

  if (priv->id == SPI2_HOST)
    {
      periph_trigger = GDMA_MAKE_TRIGGER(GDMA_TRIG_PERIPH_SPI, 2);
    }
#if defined(SOC_GDMA_TRIG_PERIPH_SPI3)
  else if (priv->id == SPI3_HOST)
    {
      periph_trigger = GDMA_MAKE_TRIGGER(GDMA_TRIG_PERIPH_SPI, 3);
    }
#endif
  else
    {
      DEBUGASSERT(0);
      return;
    }

  SPI_GDMA_NEW_CHANNEL(&tx_handle, &priv->dma_channel_tx, NULL);
  gdma_connect(priv->dma_channel_tx, periph_trigger);

  SPI_GDMA_NEW_CHANNEL(&rx_handle, NULL, &priv->dma_channel_rx);
  gdma_connect(priv->dma_channel_rx, periph_trigger);
}
#endif

/****************************************************************************
 * Name: esp_spi_init
 *
 * Description:
 *   Initialize SPI hardware interface.
 *
 * Input Parameters:
 *   dev - Device-specific state data
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp_spi_init(struct spi_dev_s *dev)
{
  struct esp_spi_priv_s *priv = (struct esp_spi_priv_s *)dev;
  const struct esp_spi_config_s *config = priv->config;
  uint32_t regval;
#if !SPI_VIA_IOMUX
#  if !SPI_HAVE_SWCS
  int cs_id = 0;
#  endif
#endif
#ifdef CONFIG_ESPRESSIF_LPSPI0
  lp_spi_bus_config_t bus_config;
#endif

  if (priv->id != ESPRESSIF_LPSPI0)
    {
      esp_gpiowrite(config->cs_pin, true);
      esp_gpiowrite(config->mosi_pin, true);
      esp_gpiowrite(config->miso_pin, true);
      esp_gpiowrite(config->clk_pin, true);

#if SPI_HAVE_SWCS
      esp_configgpio(config->cs_pin, OUTPUT_FUNCTION_2);
      esp_gpio_matrix_out(config->cs_pin, SIG_GPIO_OUT_IDX, 0, 0);
#endif

#if SPI_VIA_IOMUX
#if !SPI_HAVE_SWCS
      esp_configgpio(config->cs_pin, OUTPUT_FUNCTION_3);
      esp_gpio_matrix_out(config->cs_pin, SIG_GPIO_OUT_IDX, 0, 0);
#endif
      esp_configgpio(config->mosi_pin, OUTPUT_FUNCTION_3);
      esp_gpio_matrix_out(config->mosi_pin, SIG_GPIO_OUT_IDX, 0, 0);

      esp_configgpio(config->miso_pin, INPUT_FUNCTION_3 | PULLUP);
      esp_gpio_matrix_out(config->miso_pin, SIG_GPIO_OUT_IDX, 0, 0);

      esp_configgpio(config->clk_pin, OUTPUT_FUNCTION_3);
      esp_gpio_matrix_out(config->clk_pin, SIG_GPIO_OUT_IDX, 0, 0);
#else
    #if !SPI_HAVE_SWCS
      esp_configgpio(config->cs_pin, OUTPUT_FUNCTION_2);
      esp_gpio_matrix_out(config->cs_pin,
                          spi_periph_signal[priv->id].spics_out[cs_id],
                          0, 0);
#endif
      esp_configgpio(config->mosi_pin, MOSI_PIN_ATTR);
      esp_gpio_matrix_out(config->mosi_pin,
                          spi_periph_signal[priv->id].spid_out, 0, 0);

      esp_configgpio(config->miso_pin, MISO_PIN_ATTR);
      esp_gpio_matrix_in(config->miso_pin,
                        spi_periph_signal[priv->id].spiq_in, 0);

      esp_configgpio(config->clk_pin, OUTPUT_FUNCTION_2);
      esp_gpio_matrix_out(config->clk_pin,
                          spi_periph_signal[priv->id].spiclk_out, 0, 0);
#endif

      PERIPH_RCC_ATOMIC()
        {
          spi_ll_enable_bus_clock(priv->id, true);
          spi_ll_reset_register(priv->id);
        }

      SPI_MASTER_PERI_CLOCK_ATOMIC()
        {
          spi_ll_enable_clock(priv->id, true);
        }

#if defined(CONFIG_ESPRESSIF_SPI2_DMA) || defined(CONFIG_ESPRESSIF_SPI3_DMA)
      esp_spi_dma_init(dev);

      priv->ctx->hw = SPI_LL_GET_HW(priv->id);

      spi_ll_master_init(priv->ctx->hw);
      spi_ll_enable_int(priv->ctx->hw);
      spi_ll_set_mosi_delay(priv->ctx->hw, 0, 0);
#else
      spi_hal_init(priv->ctx, priv->id);
#endif

      esp_spi_setbits(dev, config->width);
      esp_spi_setmode(dev, priv->dev_cfg->mode);
      esp_spi_setfrequency(dev, priv->timing_param->expected_freq);
    }
#ifdef CONFIG_ESPRESSIF_LPSPI0
  else
    {
      bus_config.miso_io_num = config->miso_pin;
      bus_config.mosi_io_num = config->mosi_pin;
      bus_config.sclk_io_num = config->clk_pin;
      lp_core_lp_spi_bus_initialize(priv->id, &bus_config);
      lp_core_lp_spi_bus_add_device(priv->id, &esp_lpspi_device_config);
    }
#endif
}

/****************************************************************************
 * Name: esp_spi_deinit
 *
 * Description:
 *   Deinitialize SPI hardware interface.
 *
 * Input Parameters:
 *   dev - Device-specific state data
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp_spi_deinit(struct spi_dev_s *dev)
{
  struct esp_spi_priv_s *priv = (struct esp_spi_priv_s *)dev;

  esp_clk_tree_enable_src(priv->dev_cfg->timing_conf.clock_source, false);

  spi_hal_deinit(priv->ctx);

#if SOC_GDMA_SUPPORTED
#  if defined(CONFIG_ESPRESSIF_SPI2_DMA) || \
      defined(CONFIG_ESPRESSIF_SPI3_DMA)
  if (priv->dma_channel_rx)
    {
      gdma_disconnect(priv->dma_channel_rx);
      gdma_del_channel(priv->dma_channel_rx);
    }

  if (priv->dma_channel_tx)
    {
      gdma_disconnect(priv->dma_channel_tx);
      gdma_del_channel(priv->dma_channel_tx);
    }
#  endif
#endif

  PERIPH_RCC_ATOMIC()
    {
      spi_ll_enable_bus_clock(priv->id, false);
    }

  priv->nbits     = 0;
}

/****************************************************************************
 * Name: esp_spi_interrupt
 *
 * Description:
 *   Common SPI DMA interrupt handler.
 *
 * Input Parameters:
 *   irq     - Number of the IRQ that generated the interrupt
 *   context - Interrupt register state save info
 *   arg     - SPI controller private data
 *
 * Returned Value:
 *   Standard interrupt return value.
 *
 ****************************************************************************/

#if defined(CONFIG_ESPRESSIF_SPI2_DMA) || defined(CONFIG_ESPRESSIF_SPI3_DMA)
static int esp_spi_interrupt(int irq, void *context, void *arg)
{
  struct esp_spi_priv_s *priv = (struct esp_spi_priv_s *)arg;

