sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_spi.c
  spi_ll_clear_intr(priv->ctx->hw, SPI_LL_INTR_TRANS_DONE);
  nxsem_post(&priv->sem_isr);

  return 0;
}
#endif

/****************************************************************************
 * Name: esp_spibus_initialize
 *
 * Description:
 *   Initialize the selected SPI bus.
 *
 * Input Parameters:
 *   port - Port number (for hardware that has multiple SPI interfaces)
 *
 * Returned Value:
 *   Valid SPI device structure reference on success; NULL on failure.
 *
 ****************************************************************************/

struct spi_dev_s *esp_spibus_initialize(int port)
{
  struct spi_dev_s *spi_dev;
  struct esp_spi_priv_s *priv;
#ifdef CONFIG_PM
  int ret;
#endif

  switch (port)
    {
#ifdef CONFIG_ESPRESSIF_SPI2
      case ESPRESSIF_SPI2:
        priv = &esp_spi2_priv;
        break;
#endif
#ifdef CONFIG_ESPRESSIF_SPI3
      case ESPRESSIF_SPI3:
        priv = &esp_spi3_priv;
        break;
#endif
#ifdef CONFIG_ESPRESSIF_LPSPI0
      case ESPRESSIF_LPSPI0:
        priv = &esp_lpspi_priv;
        break;
#endif
      default:
        return NULL;
    }

  spi_dev = (struct spi_dev_s *)priv;

  nxmutex_lock(&priv->lock);
  if (priv->refs != 0)
    {
      priv->refs++;
      nxmutex_unlock(&priv->lock);
      return spi_dev;
    }

#ifdef CONFIG_PM
#  if CONFIG_ARCH_CHIP_ESP32P4
  ret = esp_pm_lock_create(ESP_PM_CPU_FREQ_MAX, 0, "spi", &priv->pm_lock);
#  else
  ret = esp_pm_lock_create(ESP_PM_APB_FREQ_MAX, 0, "spi", &priv->pm_lock);
#  endif
  if (ret != OK)
    {
      nxmutex_unlock(&priv->lock);
      spierr("Failed to create SPI PM lock for SPI:%" PRId8 "\n", priv->id);
      return NULL;
    }
#endif

  /* Initialize the blank array */

  if (priv->id != ESPRESSIF_LPSPI0)
    {
      for (int i = 0; i < SPI_BLANK_ARRAY_SIZE; i++)
        {
          blank_arr[i] = UINT32_MAX;
        }

#if defined(CONFIG_ESPRESSIF_SPI2_DMA) || defined(CONFIG_ESPRESSIF_SPI3_DMA)
      if (priv->cpuint != -ENOMEM)
        {
          /* Disable the provided CPU Interrupt to configure it. */

          up_disable_irq(ESP_SOURCE2IRQ(spi_periph_signal[priv->id].irq));
        }

      priv->cpuint = esp_setup_irq(spi_periph_signal[priv->id].irq,
                                   ESP_IRQ_PRIORITY_DEFAULT,
                                   ESP_IRQ_TRIGGER_LEVEL,
                                   esp_spi_interrupt,
                                   priv);
      if (priv->cpuint < 0)
        {
          /* Failed to allocate a CPU interrupt of this type. */

          nxmutex_unlock(&priv->lock);
          return NULL;
        }

      /* Enable the CPU interrupt that is linked to the SPI device. */

      up_enable_irq(ESP_SOURCE2IRQ(spi_periph_signal[priv->id].irq));
#endif
    }

  esp_spi_init(spi_dev);
  priv->refs++;

  nxmutex_unlock(&priv->lock);
  return spi_dev;
}

/****************************************************************************
 * Name: esp_spibus_uninitialize
 *
 * Description:
 *   Uninitialize an SPI bus.
 *
 * Input Parameters:
 *   dev - Device-specific state data
 *
 * Returned Value:
 *   Zero (OK) is returned on success. Otherwise -1 (ERROR).
 *
 ****************************************************************************/

int esp_spibus_uninitialize(struct spi_dev_s *dev)
{
  struct esp_spi_priv_s *priv = (struct esp_spi_priv_s *)dev;

  DEBUGASSERT(dev);

  if (priv->refs == 0)
    {
      return ERROR;
    }

  nxmutex_lock(&priv->lock);
  if (--priv->refs != 0)
    {
      nxmutex_unlock(&priv->lock);
      return OK;
    }

#if defined(CONFIG_ESPRESSIF_SPI2_DMA) || defined(CONFIG_ESPRESSIF_SPI3_DMA)
  up_disable_irq(ESP_SOURCE2IRQ(spi_periph_signal[priv->id].irq));
  esp_teardown_irq(spi_periph_signal[priv->id].irq, priv->cpuint);
  priv->cpuint = -ENOMEM;
#endif

#ifdef CONFIG_PM
  esp_pm_lock_delete(priv->pm_lock);
  priv->pm_lock = NULL;
#endif

  esp_spi_deinit(dev);
  nxmutex_unlock(&priv->lock);

  return OK;
}

#endif /* CONFIG_ESPRESSIF_SPI_PERIPH */
